[
{"rating": 5.0, "snippet": "Recently went to Selly Oak Sainsbury’s were a super helpful never of staff called,  Pete who worked on the produce section went out of his way to look for something I really wanted. Incredibly impressed with the level of service."}, 
{"rating": 5.0, "snippet": "Handy to have a bite to eat while waiting for family members attending the QE hospital.\nEasy parking and only 5 mins away (QE parking is impossible)!"}, 
{"rating": 5.0, "snippet": "Does exactly what it says on the tin, massive shop with lots of products to peruse and purchase. Plenty of aisles full of food, drinks, electrical goods, as well as a whole section dedicated to clothing for all ages. The 'Home' section is plentifully stocked as well, for all of your redecorating needs!\n\nIt is very good that there is an Argos in store, as buying online and picking up is very helpful."}, 
{"rating": 5.0, "snippet": "Very big, lots of choice, smart scan and App scanning. Huge TU clothing section and a very smart Argos tucked away in the corner. Helpful staff around so if you need anything know that they are there and Willing to assist"}, 
{"rating": 2.0, "snippet": "A poorly thought-out store with poor stock control and shabby practices in a badly designed retail park.\n\nThis supermarket was built in an area known officially as a \"Green Travel District\".   However, whilst the cycle parking sheltered under an overhang right outside the store entrance is good, and there is car-free access via the canal (a cycling and walking route), that's where the good practice ends.   The path used for this connection with the canal is made of sand, and is therefore very messy, and in places tricky to cycle.   It's also rather narrow for shared-use, but for me the alternatives normally represent a detour, one of which is via the undercroft car park, an area that is dark and fume-filled, and therefore not conducive to safe and pleasant cycling.   The sand path continues on as far as the Sainsbury's petrol station (a facility not generally required by people walking, wheeling, and cycling), where it effectively ends at a zebra crossing.   Between this point and the main road there is a detour around the petrol station, so people have been making their own, more direct paths.   Rather than being formalised, these have been blocked off with fences, though those who are able now climb over one of them.   Inside and outside the car park, a jam of honking cars regularly forms, earning the retail park the nickname \"Carmageddon\".   This is the inevitable consequence of building a US-style, car-centric retail park on a relief road, something that has been known as a really bad idea since long before this example was built.\n\nThe supermarket has been raised above ground to maximise the car parking, maximising the induced demand to drive, and minimising the convenience of accessing the shop floor.   Access is via two slow lifts, a steep flight of stairs, or a pair of slow travelators that burn electricity 24/7 in the Green Travel District, and which regularly break down.   At the time of writing, one of the travelators has been out of service for weeks.   Don't be surprised if when you get upstairs there are no trolleys.   This is hardly surprising because with no \"up\" travelator there will be fewer customers taking a trolley upstairs for themselves, and getting the trolleys upstairs is harder for the person who is paid to do the job.\n\nHaving finally made it to the shop floor, you'll find that in theory there is a good selection.   However, things often disappear from the shelves for weeks at a time (gaps on the shelves being quite common), and it's common for fruit and veg to expire on the day you buy it.   And this isn't a theoretical expiry, as the expiry date is so tight it's not unusual to find produce that is rotten on the shelf.   Watch out also for how things are sold.   Spring onions are sold by the bunch, but the difference between bunches is so great that it's sometimes visible (one day I measured one bunch as 100 g, and one bunch as 150 g).   And I've found the identical product for sale at two very different prices in different parts of the store.\n\nSainsbury's are making great play of going plastic free.   However, other than the elimination of single-use bags for loose produce, I can't say I've seen much change.   Indeed mushrooms used to be routinely available loose, but now they often have to be bought in a plastic punnet wrapped in cling film, a practice that not only results in unnecessary plastic waste, but which is also recognised as causing food waste.  At least they have stopped using ugly black, unrecyclable punnets.\n\nAlthough the in-store problems could be fixed with better management, the rest can only be fixed by bulldozing this two-year old retail park and starting again."}, 
{"rating": 4.0, "snippet": "I regularly go sainsburys selly oak, they have polite staff who all deserves recognition but i wanted to share what i saw a lovely shopper who is always polite to me on saturday went the extra mile and helped a lost little girl and it was great to see people helping each other out. i believe her name was Christina, she is always so kind when helping customers especially myself regularly every time i see her.\nthis sainsburys always have amazing TU area with beautiful clothing section and staff in general are very helpful with the food location.\nid recommend this shop out of all in the area."}, 
{"rating": 4.0, "snippet": "Very big. Very busy. Not the cheapest supermarket. Not suitable to just run in and grab something as it’s a walk from the car park and stairs or escalator and queues before you get out of there!"}, 
{"rating": 5.0, "snippet": "Love Sainsbury's, they have a massive clothing section for all the family, they have a lot of housewares. Parking is free for a long time. Its great."}, 
{"rating": 4.0, "snippet": "First time in this sainsburys very big, clean and well stocked. Friendly staff and at this location they actually had people on tills/checkouts always found sainsburys to have a confusing layout other than that a quality store."}, 
{"rating": 5.0, "snippet": "The woman called Linda at carluccios cafe was very helpful and kind whilst serving me and all the staff seemed welcoming too !"}, 
{"rating": 5.0, "snippet": "The new Selly Oak branch is really clean and spacious. They have SmartShop, food court with great selection of food from various companies, wide selection of TU clotches, Argos and Habitat instore. It's a great place to do your shopping. 🥙🍲🥤🛒"}, 
{"rating": 1.0, "snippet": "Yesterday I used the words \"offensive inferences\" in the review/complaint I felt obliged to submit concerning \"security\" personnel at the big Sainsbury's store in Selly Oak.\n\nI should have said OFFENSIVE INSINUATIONS."}, 
{"rating": 5.0, "snippet": "Nicely laid out store with Argos and Habitat incorporated within the complex. This is a new store so purpose built facilities. I picked up some bargains, men's clothing from Tu during the sale. One improvement I would recommend for the store is not block the community notice board with the trollies."}, 
{"rating": 5.0, "snippet": "This place is huge! Bigger isn't always better when you want to find something the size of a jam jar.\n\nOnce you take a few minutes to work out how they have set the place out, it's actually logical, maybe not easy to find your way round to begin with, but it's clear where things should be, so you can at least be sure you are in the right area easily.\n\nThe staff all seemed super helpful and even though keeping that many products on the shelf in the right quantity must be a task for someone with a brain the size of Einsteins, it's all there, in date, clean.\n\nAmazing logistics."}, 
{"rating": 5.0, "snippet": "1st visit to relatively new store, which was refreshing. Appall carparking, well signposted with easy level access. Very clean ,with good access to 1st Floor and I had a 9 item breakfast which included halloumi cheese, which was again a 1st for breakfast. Mobile running low, so sat next to charging points whilst eating breakfast.\nStaff very friendly, helpful, which doesn't go unnoticed.\nWould I return? Yes"}, 
{"rating": 1.0, "snippet": "Don't waste your time,yet again I come across another experience of dreadful customer service.\nNo fitting rooms to try garments and clothes on.\nTotal garbage.\nWhat is wrong with company's today.\nSainsbury's battery park (disgrace)"}, 
{"rating": 1.0, "snippet": "I had high hopes for trying the new Mini Eggs milkshake at this restaurant, especially after seeing it advertised online. However, my experience was far from what I expected.\n\nI arrived at the restaurant at 4:00 PM, and while the online hours indicated they close at 5:00 PM, I encountered several issues that left me frustrated. Upon arriving, I stood behind a few customers who were taking longer than expected to order, so I patiently waited. After about five minutes, I noticed that one of the staff members saw me and the family behind me waiting but didn’t seem to acknowledge us.\n\nThe situation worsened when the family behind me decided to leave due to the long wait. Even though there was an empty till available, it remained unused. One staff member appeared to be disengaged, spending time on his phone, completely ignoring the growing queue. I eventually had to ask him directly to be served, at which point he finally proceeded with my order.\n\nI asked for the milkshake, but he informed me that the machine had been turned off. However, I could clearly see the machine was still on, and it was evident that he wasn’t attending to customers. His behavior felt unprofessional, and his lack of attention to the needs of customers was disappointing, especially given the small window of time before closing.\n\nOverall, while the food and drink might be good, the service I received was poor and left me questioning whether I’d return. It’s crucial for staff to be attentive and professional, especially during business hours, and this experience unfortunately did not reflect that."}, 
{"rating": 5.0, "snippet": "The staff was good.. they directed me well. Very fast service"}, 
{"rating": 4.0, "snippet": "Very large supermarket with a massive selection of everything.  Variety of shops nearby"}, 
{"rating": 1.0, "snippet": "Went here for breakfast. Absolutely shocking £25 for 2 breakfasts and it was well below standard.  Toast dry as hell bacon didn't even look like bacon sausage not bad, but only 1. Beans I don't even think there was 2 spoons full. 2 Hash browns ok and a few tiny cold mushrooms. Egg ok and a fried tomato. Not worth the money would not repeat this experience"}, 
{"rating": 5.0, "snippet": "Recently went to Selly Oak Sainsbury’s were a super helpful never of staff called,  Pete who worked on the produce section went out of his way to look for something I really wanted. Incredibly impressed with the level of service."}, 
{"rating": 5.0, "snippet": "Handy to have a bite to eat while waiting for family members attending the QE hospital.\nEasy parking and only 5 mins away (QE parking is impossible)!"}, 
{"rating": 5.0, "snippet": "Does exactly what it says on the tin, massive shop with lots of products to peruse and purchase. Plenty of aisles full of food, drinks, electrical goods, as well as a whole section dedicated to clothing for all ages. The 'Home' section is plentifully stocked as well, for all of your redecorating needs!\n\nIt is very good that there is an Argos in store, as buying online and picking up is very helpful."}, 
{"rating": 5.0, "snippet": "Very big, lots of choice, smart scan and App scanning. Huge TU clothing section and a very smart Argos tucked away in the corner. Helpful staff around so if you need anything know that they are there and Willing to assist"}, 
{"rating": 2.0, "snippet": "A poorly thought-out store with poor stock control and shabby practices in a badly designed retail park.\n\nThis supermarket was built in an area known officially as a \"Green Travel District\".   However, whilst the cycle parking sheltered under an overhang right outside the store entrance is good, and there is car-free access via the canal (a cycling and walking route), that's where the good practice ends.   The path used for this connection with the canal is made of sand, and is therefore very messy, and in places tricky to cycle.   It's also rather narrow for shared-use, but for me the alternatives normally represent a detour, one of which is via the undercroft car park, an area that is dark and fume-filled, and therefore not conducive to safe and pleasant cycling.   The sand path continues on as far as the Sainsbury's petrol station (a facility not generally required by people walking, wheeling, and cycling), where it effectively ends at a zebra crossing.   Between this point and the main road there is a detour around the petrol station, so people have been making their own, more direct paths.   Rather than being formalised, these have been blocked off with fences, though those who are able now climb over one of them.   Inside and outside the car park, a jam of honking cars regularly forms, earning the retail park the nickname \"Carmageddon\".   This is the inevitable consequence of building a US-style, car-centric retail park on a relief road, something that has been known as a really bad idea since long before this example was built.\n\nThe supermarket has been raised above ground to maximise the car parking, maximising the induced demand to drive, and minimising the convenience of accessing the shop floor.   Access is via two slow lifts, a steep flight of stairs, or a pair of slow travelators that burn electricity 24/7 in the Green Travel District, and which regularly break down.   At the time of writing, one of the travelators has been out of service for weeks.   Don't be surprised if when you get upstairs there are no trolleys.   This is hardly surprising because with no \"up\" travelator there will be fewer customers taking a trolley upstairs for themselves, and getting the trolleys upstairs is harder for the person who is paid to do the job.\n\nHaving finally made it to the shop floor, you'll find that in theory there is a good selection.   However, things often disappear from the shelves for weeks at a time (gaps on the shelves being quite common), and it's common for fruit and veg to expire on the day you buy it.   And this isn't a theoretical expiry, as the expiry date is so tight it's not unusual to find produce that is rotten on the shelf.   Watch out also for how things are sold.   Spring onions are sold by the bunch, but the difference between bunches is so great that it's sometimes visible (one day I measured one bunch as 100 g, and one bunch as 150 g).   And I've found the identical product for sale at two very different prices in different parts of the store.\n\nSainsbury's are making great play of going plastic free.   However, other than the elimination of single-use bags for loose produce, I can't say I've seen much change.   Indeed mushrooms used to be routinely available loose, but now they often have to be bought in a plastic punnet wrapped in cling film, a practice that not only results in unnecessary plastic waste, but which is also recognised as causing food waste.  At least they have stopped using ugly black, unrecyclable punnets.\n\nAlthough the in-store problems could be fixed with better management, the rest can only be fixed by bulldozing this two-year old retail park and starting again."}, 
{"rating": 4.0, "snippet": "I regularly go sainsburys selly oak, they have polite staff who all deserves recognition but i wanted to share what i saw a lovely shopper who is always polite to me on saturday went the extra mile and helped a lost little girl and it was great to see people helping each other out. i believe her name was Christina, she is always so kind when helping customers especially myself regularly every time i see her.\nthis sainsburys always have amazing TU area with beautiful clothing section and staff in general are very helpful with the food location.\nid recommend this shop out of all in the area."}, 
{"rating": 4.0, "snippet": "Very big. Very busy. Not the cheapest supermarket. Not suitable to just run in and grab something as it’s a walk from the car park and stairs or escalator and queues before you get out of there!"}, 
{"rating": 5.0, "snippet": "Love Sainsbury's, they have a massive clothing section for all the family, they have a lot of housewares. Parking is free for a long time. Its great."}, 
{"rating": 4.0, "snippet": "First time in this sainsburys very big, clean and well stocked. Friendly staff and at this location they actually had people on tills/checkouts always found sainsburys to have a confusing layout other than that a quality store."}, 
{"rating": 5.0, "snippet": "The woman called Linda at carluccios cafe was very helpful and kind whilst serving me and all the staff seemed welcoming too !"}, 
{"rating": 5.0, "snippet": "The new Selly Oak branch is really clean and spacious. They have SmartShop, food court with great selection of food from various companies, wide selection of TU clotches, Argos and Habitat instore. It's a great place to do your shopping. 🥙🍲🥤🛒"}, 
{"rating": 1.0, "snippet": "Yesterday I used the words \"offensive inferences\" in the review/complaint I felt obliged to submit concerning \"security\" personnel at the big Sainsbury's store in Selly Oak.\n\nI should have said OFFENSIVE INSINUATIONS."}, 
{"rating": 5.0, "snippet": "Nicely laid out store with Argos and Habitat incorporated within the complex. This is a new store so purpose built facilities. I picked up some bargains, men's clothing from Tu during the sale. One improvement I would recommend for the store is not block the community notice board with the trollies."}, 
{"rating": 5.0, "snippet": "This place is huge! Bigger isn't always better when you want to find something the size of a jam jar.\n\nOnce you take a few minutes to work out how they have set the place out, it's actually logical, maybe not easy to find your way round to begin with, but it's clear where things should be, so you can at least be sure you are in the right area easily.\n\nThe staff all seemed super helpful and even though keeping that many products on the shelf in the right quantity must be a task for someone with a brain the size of Einsteins, it's all there, in date, clean.\n\nAmazing logistics."}, 
{"rating": 5.0, "snippet": "1st visit to relatively new store, which was refreshing. Appall carparking, well signposted with easy level access. Very clean ,with good access to 1st Floor and I had a 9 item breakfast which included halloumi cheese, which was again a 1st for breakfast. Mobile running low, so sat next to charging points whilst eating breakfast.\nStaff very friendly, helpful, which doesn't go unnoticed.\nWould I return? Yes"}, 
{"rating": 1.0, "snippet": "Don't waste your time,yet again I come across another experience of dreadful customer service.\nNo fitting rooms to try garments and clothes on.\nTotal garbage.\nWhat is wrong with company's today.\nSainsbury's battery park (disgrace)"}, 
{"rating": 1.0, "snippet": "I had high hopes for trying the new Mini Eggs milkshake at this restaurant, especially after seeing it advertised online. However, my experience was far from what I expected.\n\nI arrived at the restaurant at 4:00 PM, and while the online hours indicated they close at 5:00 PM, I encountered several issues that left me frustrated. Upon arriving, I stood behind a few customers who were taking longer than expected to order, so I patiently waited. After about five minutes, I noticed that one of the staff members saw me and the family behind me waiting but didn’t seem to acknowledge us.\n\nThe situation worsened when the family behind me decided to leave due to the long wait. Even though there was an empty till available, it remained unused. One staff member appeared to be disengaged, spending time on his phone, completely ignoring the growing queue. I eventually had to ask him directly to be served, at which point he finally proceeded with my order.\n\nI asked for the milkshake, but he informed me that the machine had been turned off. However, I could clearly see the machine was still on, and it was evident that he wasn’t attending to customers. His behavior felt unprofessional, and his lack of attention to the needs of customers was disappointing, especially given the small window of time before closing.\n\nOverall, while the food and drink might be good, the service I received was poor and left me questioning whether I’d return. It’s crucial for staff to be attentive and professional, especially during business hours, and this experience unfortunately did not reflect that."}, 
{"rating": 5.0, "snippet": "The staff was good.. they directed me well. Very fast service"}, 
{"rating": 4.0, "snippet": "Very large supermarket with a massive selection of everything.  Variety of shops nearby"}, 
{"rating": 1.0, "snippet": "Went here for breakfast. Absolutely shocking £25 for 2 breakfasts and it was well below standard.  Toast dry as hell bacon didn't even look like bacon sausage not bad, but only 1. Beans I don't even think there was 2 spoons full. 2 Hash browns ok and a few tiny cold mushrooms. Egg ok and a fried tomato. Not worth the money would not repeat this experience"}, 
{"rating": 5.0, "snippet": "Recently went to Selly Oak Sainsbury’s were a super helpful never of staff called,  Pete who worked on the produce section went out of his way to look for something I really wanted. Incredibly impressed with the level of service."}, 
{"rating": 5.0, "snippet": "Handy to have a bite to eat while waiting for family members attending the QE hospital.\nEasy parking and only 5 mins away (QE parking is impossible)!"}, 
{"rating": 5.0, "snippet": "Does exactly what it says on the tin, massive shop with lots of products to peruse and purchase. Plenty of aisles full of food, drinks, electrical goods, as well as a whole section dedicated to clothing for all ages. The 'Home' section is plentifully stocked as well, for all of your redecorating needs!\n\nIt is very good that there is an Argos in store, as buying online and picking up is very helpful."}, 
{"rating": 5.0, "snippet": "Very big, lots of choice, smart scan and App scanning. Huge TU clothing section and a very smart Argos tucked away in the corner. Helpful staff around so if you need anything know that they are there and Willing to assist"}, 
{"rating": 2.0, "snippet": "A poorly thought-out store with poor stock control and shabby practices in a badly designed retail park.\n\nThis supermarket was built in an area known officially as a \"Green Travel District\".   However, whilst the cycle parking sheltered under an overhang right outside the store entrance is good, and there is car-free access via the canal (a cycling and walking route), that's where the good practice ends.   The path used for this connection with the canal is made of sand, and is therefore very messy, and in places tricky to cycle.   It's also rather narrow for shared-use, but for me the alternatives normally represent a detour, one of which is via the undercroft car park, an area that is dark and fume-filled, and therefore not conducive to safe and pleasant cycling.   The sand path continues on as far as the Sainsbury's petrol station (a facility not generally required by people walking, wheeling, and cycling), where it effectively ends at a zebra crossing.   Between this point and the main road there is a detour around the petrol station, so people have been making their own, more direct paths.   Rather than being formalised, these have been blocked off with fences, though those who are able now climb over one of them.   Inside and outside the car park, a jam of honking cars regularly forms, earning the retail park the nickname \"Carmageddon\".   This is the inevitable consequence of building a US-style, car-centric retail park on a relief road, something that has been known as a really bad idea since long before this example was built.\n\nThe supermarket has been raised above ground to maximise the car parking, maximising the induced demand to drive, and minimising the convenience of accessing the shop floor.   Access is via two slow lifts, a steep flight of stairs, or a pair of slow travelators that burn electricity 24/7 in the Green Travel District, and which regularly break down.   At the time of writing, one of the travelators has been out of service for weeks.   Don't be surprised if when you get upstairs there are no trolleys.   This is hardly surprising because with no \"up\" travelator there will be fewer customers taking a trolley upstairs for themselves, and getting the trolleys upstairs is harder for the person who is paid to do the job.\n\nHaving finally made it to the shop floor, you'll find that in theory there is a good selection.   However, things often disappear from the shelves for weeks at a time (gaps on the shelves being quite common), and it's common for fruit and veg to expire on the day you buy it.   And this isn't a theoretical expiry, as the expiry date is so tight it's not unusual to find produce that is rotten on the shelf.   Watch out also for how things are sold.   Spring onions are sold by the bunch, but the difference between bunches is so great that it's sometimes visible (one day I measured one bunch as 100 g, and one bunch as 150 g).   And I've found the identical product for sale at two very different prices in different parts of the store.\n\nSainsbury's are making great play of going plastic free.   However, other than the elimination of single-use bags for loose produce, I can't say I've seen much change.   Indeed mushrooms used to be routinely available loose, but now they often have to be bought in a plastic punnet wrapped in cling film, a practice that not only results in unnecessary plastic waste, but which is also recognised as causing food waste.  At least they have stopped using ugly black, unrecyclable punnets.\n\nAlthough the in-store problems could be fixed with better management, the rest can only be fixed by bulldozing this two-year old retail park and starting again."}, 
{"rating": 4.0, "snippet": "I regularly go sainsburys selly oak, they have polite staff who all deserves recognition but i wanted to share what i saw a lovely shopper who is always polite to me on saturday went the extra mile and helped a lost little girl and it was great to see people helping each other out. i believe her name was Christina, she is always so kind when helping customers especially myself regularly every time i see her.\nthis sainsburys always have amazing TU area with beautiful clothing section and staff in general are very helpful with the food location.\nid recommend this shop out of all in the area."}, 
{"rating": 4.0, "snippet": "Very big. Very busy. Not the cheapest supermarket. Not suitable to just run in and grab something as it’s a walk from the car park and stairs or escalator and queues before you get out of there!"}, 
{"rating": 5.0, "snippet": "Love Sainsbury's, they have a massive clothing section for all the family, they have a lot of housewares. Parking is free for a long time. Its great."}, 
{"rating": 4.0, "snippet": "First time in this sainsburys very big, clean and well stocked. Friendly staff and at this location they actually had people on tills/checkouts always found sainsburys to have a confusing layout other than that a quality store."}, 
{"rating": 5.0, "snippet": "The woman called Linda at carluccios cafe was very helpful and kind whilst serving me and all the staff seemed welcoming too !"}, 
{"rating": 5.0, "snippet": "The new Selly Oak branch is really clean and spacious. They have SmartShop, food court with great selection of food from various companies, wide selection of TU clotches, Argos and Habitat instore. It's a great place to do your shopping. 🥙🍲🥤🛒"}, 
{"rating": 1.0, "snippet": "Yesterday I used the words \"offensive inferences\" in the review/complaint I felt obliged to submit concerning \"security\" personnel at the big Sainsbury's store in Selly Oak.\n\nI should have said OFFENSIVE INSINUATIONS."}, 
{"rating": 5.0, "snippet": "Nicely laid out store with Argos and Habitat incorporated within the complex. This is a new store so purpose built facilities. I picked up some bargains, men's clothing from Tu during the sale. One improvement I would recommend for the store is not block the community notice board with the trollies."}, 
{"rating": 5.0, "snippet": "This place is huge! Bigger isn't always better when you want to find something the size of a jam jar.\n\nOnce you take a few minutes to work out how they have set the place out, it's actually logical, maybe not easy to find your way round to begin with, but it's clear where things should be, so you can at least be sure you are in the right area easily.\n\nThe staff all seemed super helpful and even though keeping that many products on the shelf in the right quantity must be a task for someone with a brain the size of Einsteins, it's all there, in date, clean.\n\nAmazing logistics."}, 
{"rating": 5.0, "snippet": "1st visit to relatively new store, which was refreshing. Appall carparking, well signposted with easy level access. Very clean ,with good access to 1st Floor and I had a 9 item breakfast which included halloumi cheese, which was again a 1st for breakfast. Mobile running low, so sat next to charging points whilst eating breakfast.\nStaff very friendly, helpful, which doesn't go unnoticed.\nWould I return? Yes"}, 
{"rating": 1.0, "snippet": "Don't waste your time,yet again I come across another experience of dreadful customer service.\nNo fitting rooms to try garments and clothes on.\nTotal garbage.\nWhat is wrong with company's today.\nSainsbury's battery park (disgrace)"}, 
{"rating": 1.0, "snippet": "I had high hopes for trying the new Mini Eggs milkshake at this restaurant, especially after seeing it advertised online. However, my experience was far from what I expected.\n\nI arrived at the restaurant at 4:00 PM, and while the online hours indicated they close at 5:00 PM, I encountered several issues that left me frustrated. Upon arriving, I stood behind a few customers who were taking longer than expected to order, so I patiently waited. After about five minutes, I noticed that one of the staff members saw me and the family behind me waiting but didn’t seem to acknowledge us.\n\nThe situation worsened when the family behind me decided to leave due to the long wait. Even though there was an empty till available, it remained unused. One staff member appeared to be disengaged, spending time on his phone, completely ignoring the growing queue. I eventually had to ask him directly to be served, at which point he finally proceeded with my order.\n\nI asked for the milkshake, but he informed me that the machine had been turned off. However, I could clearly see the machine was still on, and it was evident that he wasn’t attending to customers. His behavior felt unprofessional, and his lack of attention to the needs of customers was disappointing, especially given the small window of time before closing.\n\nOverall, while the food and drink might be good, the service I received was poor and left me questioning whether I’d return. It’s crucial for staff to be attentive and professional, especially during business hours, and this experience unfortunately did not reflect that."}, 
{"rating": 5.0, "snippet": "The staff was good.. they directed me well. Very fast service"}, 
{"rating": 4.0, "snippet": "Very large supermarket with a massive selection of everything.  Variety of shops nearby"}, 
{"rating": 1.0, "snippet": "Went here for breakfast. Absolutely shocking £25 for 2 breakfasts and it was well below standard.  Toast dry as hell bacon didn't even look like bacon sausage not bad, but only 1. Beans I don't even think there was 2 spoons full. 2 Hash browns ok and a few tiny cold mushrooms. Egg ok and a fried tomato. Not worth the money would not repeat this experience"}, 
{"rating": 5.0, "snippet": "Recently went to Selly Oak Sainsbury’s were a super helpful never of staff called,  Pete who worked on the produce section went out of his way to look for something I really wanted. Incredibly impressed with the level of service."}, 
{"rating": 5.0, "snippet": "Handy to have a bite to eat while waiting for family members attending the QE hospital.\nEasy parking and only 5 mins away (QE parking is impossible)!"}, 
{"rating": 5.0, "snippet": "Does exactly what it says on the tin, massive shop with lots of products to peruse and purchase. Plenty of aisles full of food, drinks, electrical goods, as well as a whole section dedicated to clothing for all ages. The 'Home' section is plentifully stocked as well, for all of your redecorating needs!\n\nIt is very good that there is an Argos in store, as buying online and picking up is very helpful."}, 
{"rating": 5.0, "snippet": "Very big, lots of choice, smart scan and App scanning. Huge TU clothing section and a very smart Argos tucked away in the corner. Helpful staff around so if you need anything know that they are there and Willing to assist"}, 
{"rating": 2.0, "snippet": "A poorly thought-out store with poor stock control and shabby practices in a badly designed retail park.\n\nThis supermarket was built in an area known officially as a \"Green Travel District\".   However, whilst the cycle parking sheltered under an overhang right outside the store entrance is good, and there is car-free access via the canal (a cycling and walking route), that's where the good practice ends.   The path used for this connection with the canal is made of sand, and is therefore very messy, and in places tricky to cycle.   It's also rather narrow for shared-use, but for me the alternatives normally represent a detour, one of which is via the undercroft car park, an area that is dark and fume-filled, and therefore not conducive to safe and pleasant cycling.   The sand path continues on as far as the Sainsbury's petrol station (a facility not generally required by people walking, wheeling, and cycling), where it effectively ends at a zebra crossing.   Between this point and the main road there is a detour around the petrol station, so people have been making their own, more direct paths.   Rather than being formalised, these have been blocked off with fences, though those who are able now climb over one of them.   Inside and outside the car park, a jam of honking cars regularly forms, earning the retail park the nickname \"Carmageddon\".   This is the inevitable consequence of building a US-style, car-centric retail park on a relief road, something that has been known as a really bad idea since long before this example was built.\n\nThe supermarket has been raised above ground to maximise the car parking, maximising the induced demand to drive, and minimising the convenience of accessing the shop floor.   Access is via two slow lifts, a steep flight of stairs, or a pair of slow travelators that burn electricity 24/7 in the Green Travel District, and which regularly break down.   At the time of writing, one of the travelators has been out of service for weeks.   Don't be surprised if when you get upstairs there are no trolleys.   This is hardly surprising because with no \"up\" travelator there will be fewer customers taking a trolley upstairs for themselves, and getting the trolleys upstairs is harder for the person who is paid to do the job.\n\nHaving finally made it to the shop floor, you'll find that in theory there is a good selection.   However, things often disappear from the shelves for weeks at a time (gaps on the shelves being quite common), and it's common for fruit and veg to expire on the day you buy it.   And this isn't a theoretical expiry, as the expiry date is so tight it's not unusual to find produce that is rotten on the shelf.   Watch out also for how things are sold.   Spring onions are sold by the bunch, but the difference between bunches is so great that it's sometimes visible (one day I measured one bunch as 100 g, and one bunch as 150 g).   And I've found the identical product for sale at two very different prices in different parts of the store.\n\nSainsbury's are making great play of going plastic free.   However, other than the elimination of single-use bags for loose produce, I can't say I've seen much change.   Indeed mushrooms used to be routinely available loose, but now they often have to be bought in a plastic punnet wrapped in cling film, a practice that not only results in unnecessary plastic waste, but which is also recognised as causing food waste.  At least they have stopped using ugly black, unrecyclable punnets.\n\nAlthough the in-store problems could be fixed with better management, the rest can only be fixed by bulldozing this two-year old retail park and starting again."}, 
{"rating": 4.0, "snippet": "I regularly go sainsburys selly oak, they have polite staff who all deserves recognition but i wanted to share what i saw a lovely shopper who is always polite to me on saturday went the extra mile and helped a lost little girl and it was great to see people helping each other out. i believe her name was Christina, she is always so kind when helping customers especially myself regularly every time i see her.\nthis sainsburys always have amazing TU area with beautiful clothing section and staff in general are very helpful with the food location.\nid recommend this shop out of all in the area."}, 
{"rating": 4.0, "snippet": "Very big. Very busy. Not the cheapest supermarket. Not suitable to just run in and grab something as it’s a walk from the car park and stairs or escalator and queues before you get out of there!"}, 
{"rating": 5.0, "snippet": "Love Sainsbury's, they have a massive clothing section for all the family, they have a lot of housewares. Parking is free for a long time. Its great."}, 
{"rating": 4.0, "snippet": "First time in this sainsburys very big, clean and well stocked. Friendly staff and at this location they actually had people on tills/checkouts always found sainsburys to have a confusing layout other than that a quality store."}, 
{"rating": 5.0, "snippet": "The woman called Linda at carluccios cafe was very helpful and kind whilst serving me and all the staff seemed welcoming too !"}, 
{"rating": 5.0, "snippet": "The new Selly Oak branch is really clean and spacious. They have SmartShop, food court with great selection of food from various companies, wide selection of TU clotches, Argos and Habitat instore. It's a great place to do your shopping. 🥙🍲🥤🛒"}, 
{"rating": 1.0, "snippet": "Yesterday I used the words \"offensive inferences\" in the review/complaint I felt obliged to submit concerning \"security\" personnel at the big Sainsbury's store in Selly Oak.\n\nI should have said OFFENSIVE INSINUATIONS."}, 
{"rating": 5.0, "snippet": "Nicely laid out store with Argos and Habitat incorporated within the complex. This is a new store so purpose built facilities. I picked up some bargains, men's clothing from Tu during the sale. One improvement I would recommend for the store is not block the community notice board with the trollies."}, 
{"rating": 5.0, "snippet": "This place is huge! Bigger isn't always better when you want to find something the size of a jam jar.\n\nOnce you take a few minutes to work out how they have set the place out, it's actually logical, maybe not easy to find your way round to begin with, but it's clear where things should be, so you can at least be sure you are in the right area easily.\n\nThe staff all seemed super helpful and even though keeping that many products on the shelf in the right quantity must be a task for someone with a brain the size of Einsteins, it's all there, in date, clean.\n\nAmazing logistics."}, 
{"rating": 5.0, "snippet": "1st visit to relatively new store, which was refreshing. Appall carparking, well signposted with easy level access. Very clean ,with good access to 1st Floor and I had a 9 item breakfast which included halloumi cheese, which was again a 1st for breakfast. Mobile running low, so sat next to charging points whilst eating breakfast.\nStaff very friendly, helpful, which doesn't go unnoticed.\nWould I return? Yes"}, 
{"rating": 1.0, "snippet": "Don't waste your time,yet again I come across another experience of dreadful customer service.\nNo fitting rooms to try garments and clothes on.\nTotal garbage.\nWhat is wrong with company's today.\nSainsbury's battery park (disgrace)"}, 
{"rating": 1.0, "snippet": "I had high hopes for trying the new Mini Eggs milkshake at this restaurant, especially after seeing it advertised online. However, my experience was far from what I expected.\n\nI arrived at the restaurant at 4:00 PM, and while the online hours indicated they close at 5:00 PM, I encountered several issues that left me frustrated. Upon arriving, I stood behind a few customers who were taking longer than expected to order, so I patiently waited. After about five minutes, I noticed that one of the staff members saw me and the family behind me waiting but didn’t seem to acknowledge us.\n\nThe situation worsened when the family behind me decided to leave due to the long wait. Even though there was an empty till available, it remained unused. One staff member appeared to be disengaged, spending time on his phone, completely ignoring the growing queue. I eventually had to ask him directly to be served, at which point he finally proceeded with my order.\n\nI asked for the milkshake, but he informed me that the machine had been turned off. However, I could clearly see the machine was still on, and it was evident that he wasn’t attending to customers. His behavior felt unprofessional, and his lack of attention to the needs of customers was disappointing, especially given the small window of time before closing.\n\nOverall, while the food and drink might be good, the service I received was poor and left me questioning whether I’d return. It’s crucial for staff to be attentive and professional, especially during business hours, and this experience unfortunately did not reflect that."}, 
{"rating": 5.0, "snippet": "The staff was good.. they directed me well. Very fast service"}, 
{"rating": 4.0, "snippet": "Very large supermarket with a massive selection of everything.  Variety of shops nearby"}, 
{"rating": 1.0, "snippet": "Went here for breakfast. Absolutely shocking £25 for 2 breakfasts and it was well below standard.  Toast dry as hell bacon didn't even look like bacon sausage not bad, but only 1. Beans I don't even think there was 2 spoons full. 2 Hash browns ok and a few tiny cold mushrooms. Egg ok and a fried tomato. Not worth the money would not repeat this experience"}, 
{"rating": 5.0, "snippet": "Recently went to Selly Oak Sainsbury’s were a super helpful never of staff called,  Pete who worked on the produce section went out of his way to look for something I really wanted. Incredibly impressed with the level of service."}, 
{"rating": 5.0, "snippet": "Handy to have a bite to eat while waiting for family members attending the QE hospital.\nEasy parking and only 5 mins away (QE parking is impossible)!"}, 
{"rating": 5.0, "snippet": "Does exactly what it says on the tin, massive shop with lots of products to peruse and purchase. Plenty of aisles full of food, drinks, electrical goods, as well as a whole section dedicated to clothing for all ages. The 'Home' section is plentifully stocked as well, for all of your redecorating needs!\n\nIt is very good that there is an Argos in store, as buying online and picking up is very helpful."}, 
{"rating": 5.0, "snippet": "Very big, lots of choice, smart scan and App scanning. Huge TU clothing section and a very smart Argos tucked away in the corner. Helpful staff around so if you need anything know that they are there and Willing to assist"}, 
{"rating": 2.0, "snippet": "A poorly thought-out store with poor stock control and shabby practices in a badly designed retail park.\n\nThis supermarket was built in an area known officially as a \"Green Travel District\".   However, whilst the cycle parking sheltered under an overhang right outside the store entrance is good, and there is car-free access via the canal (a cycling and walking route), that's where the good practice ends.   The path used for this connection with the canal is made of sand, and is therefore very messy, and in places tricky to cycle.   It's also rather narrow for shared-use, but for me the alternatives normally represent a detour, one of which is via the undercroft car park, an area that is dark and fume-filled, and therefore not conducive to safe and pleasant cycling.   The sand path continues on as far as the Sainsbury's petrol station (a facility not generally required by people walking, wheeling, and cycling), where it effectively ends at a zebra crossing.   Between this point and the main road there is a detour around the petrol station, so people have been making their own, more direct paths.   Rather than being formalised, these have been blocked off with fences, though those who are able now climb over one of them.   Inside and outside the car park, a jam of honking cars regularly forms, earning the retail park the nickname \"Carmageddon\".   This is the inevitable consequence of building a US-style, car-centric retail park on a relief road, something that has been known as a really bad idea since long before this example was built.\n\nThe supermarket has been raised above ground to maximise the car parking, maximising the induced demand to drive, and minimising the convenience of accessing the shop floor.   Access is via two slow lifts, a steep flight of stairs, or a pair of slow travelators that burn electricity 24/7 in the Green Travel District, and which regularly break down.   At the time of writing, one of the travelators has been out of service for weeks.   Don't be surprised if when you get upstairs there are no trolleys.   This is hardly surprising because with no \"up\" travelator there will be fewer customers taking a trolley upstairs for themselves, and getting the trolleys upstairs is harder for the person who is paid to do the job.\n\nHaving finally made it to the shop floor, you'll find that in theory there is a good selection.   However, things often disappear from the shelves for weeks at a time (gaps on the shelves being quite common), and it's common for fruit and veg to expire on the day you buy it.   And this isn't a theoretical expiry, as the expiry date is so tight it's not unusual to find produce that is rotten on the shelf.   Watch out also for how things are sold.   Spring onions are sold by the bunch, but the difference between bunches is so great that it's sometimes visible (one day I measured one bunch as 100 g, and one bunch as 150 g).   And I've found the identical product for sale at two very different prices in different parts of the store.\n\nSainsbury's are making great play of going plastic free.   However, other than the elimination of single-use bags for loose produce, I can't say I've seen much change.   Indeed mushrooms used to be routinely available loose, but now they often have to be bought in a plastic punnet wrapped in cling film, a practice that not only results in unnecessary plastic waste, but which is also recognised as causing food waste.  At least they have stopped using ugly black, unrecyclable punnets.\n\nAlthough the in-store problems could be fixed with better management, the rest can only be fixed by bulldozing this two-year old retail park and starting again."}, 
{"rating": 4.0, "snippet": "I regularly go sainsburys selly oak, they have polite staff who all deserves recognition but i wanted to share what i saw a lovely shopper who is always polite to me on saturday went the extra mile and helped a lost little girl and it was great to see people helping each other out. i believe her name was Christina, she is always so kind when helping customers especially myself regularly every time i see her.\nthis sainsburys always have amazing TU area with beautiful clothing section and staff in general are very helpful with the food location.\nid recommend this shop out of all in the area."}, 
{"rating": 4.0, "snippet": "Very big. Very busy. Not the cheapest supermarket. Not suitable to just run in and grab something as it’s a walk from the car park and stairs or escalator and queues before you get out of there!"}, 
{"rating": 5.0, "snippet": "Love Sainsbury's, they have a massive clothing section for all the family, they have a lot of housewares. Parking is free for a long time. Its great."}, 
{"rating": 4.0, "snippet": "First time in this sainsburys very big, clean and well stocked. Friendly staff and at this location they actually had people on tills/checkouts always found sainsburys to have a confusing layout other than that a quality store."}, 
{"rating": 5.0, "snippet": "The woman called Linda at carluccios cafe was very helpful and kind whilst serving me and all the staff seemed welcoming too !"}, 
{"rating": 5.0, "snippet": "The new Selly Oak branch is really clean and spacious. They have SmartShop, food court with great selection of food from various companies, wide selection of TU clotches, Argos and Habitat instore. It's a great place to do your shopping. 🥙🍲🥤🛒"}, 
{"rating": 1.0, "snippet": "Yesterday I used the words \"offensive inferences\" in the review/complaint I felt obliged to submit concerning \"security\" personnel at the big Sainsbury's store in Selly Oak.\n\nI should have said OFFENSIVE INSINUATIONS."}, 
{"rating": 5.0, "snippet": "Nicely laid out store with Argos and Habitat incorporated within the complex. This is a new store so purpose built facilities. I picked up some bargains, men's clothing from Tu during the sale. One improvement I would recommend for the store is not block the community notice board with the trollies."}, 
{"rating": 5.0, "snippet": "This place is huge! Bigger isn't always better when you want to find something the size of a jam jar.\n\nOnce you take a few minutes to work out how they have set the place out, it's actually logical, maybe not easy to find your way round to begin with, but it's clear where things should be, so you can at least be sure you are in the right area easily.\n\nThe staff all seemed super helpful and even though keeping that many products on the shelf in the right quantity must be a task for someone with a brain the size of Einsteins, it's all there, in date, clean.\n\nAmazing logistics."}, 
{"rating": 5.0, "snippet": "1st visit to relatively new store, which was refreshing. Appall carparking, well signposted with easy level access. Very clean ,with good access to 1st Floor and I had a 9 item breakfast which included halloumi cheese, which was again a 1st for breakfast. Mobile running low, so sat next to charging points whilst eating breakfast.\nStaff very friendly, helpful, which doesn't go unnoticed.\nWould I return? Yes"}, 
{"rating": 1.0, "snippet": "Don't waste your time,yet again I come across another experience of dreadful customer service.\nNo fitting rooms to try garments and clothes on.\nTotal garbage.\nWhat is wrong with company's today.\nSainsbury's battery park (disgrace)"}, 
{"rating": 1.0, "snippet": "I had high hopes for trying the new Mini Eggs milkshake at this restaurant, especially after seeing it advertised online. However, my experience was far from what I expected.\n\nI arrived at the restaurant at 4:00 PM, and while the online hours indicated they close at 5:00 PM, I encountered several issues that left me frustrated. Upon arriving, I stood behind a few customers who were taking longer than expected to order, so I patiently waited. After about five minutes, I noticed that one of the staff members saw me and the family behind me waiting but didn’t seem to acknowledge us.\n\nThe situation worsened when the family behind me decided to leave due to the long wait. Even though there was an empty till available, it remained unused. One staff member appeared to be disengaged, spending time on his phone, completely ignoring the growing queue. I eventually had to ask him directly to be served, at which point he finally proceeded with my order.\n\nI asked for the milkshake, but he informed me that the machine had been turned off. However, I could clearly see the machine was still on, and it was evident that he wasn’t attending to customers. His behavior felt unprofessional, and his lack of attention to the needs of customers was disappointing, especially given the small window of time before closing.\n\nOverall, while the food and drink might be good, the service I received was poor and left me questioning whether I’d return. It’s crucial for staff to be attentive and professional, especially during business hours, and this experience unfortunately did not reflect that."}, 
{"rating": 5.0, "snippet": "The staff was good.. they directed me well. Very fast service"}, 
{"rating": 4.0, "snippet": "Very large supermarket with a massive selection of everything.  Variety of shops nearby"}, 
{"rating": 1.0, "snippet": "Went here for breakfast. Absolutely shocking £25 for 2 breakfasts and it was well below standard.  Toast dry as hell bacon didn't even look like bacon sausage not bad, but only 1. Beans I don't even think there was 2 spoons full. 2 Hash browns ok and a few tiny cold mushrooms. Egg ok and a fried tomato. Not worth the money would not repeat this experience"}
]